class ListDataMorning {
  final List<String> listMorningQuestions = [
    'Что в моей жизни сейчас\nделает меня счастливым?',
    'Что в этом делает меня счастливым?',
    'Какие ощущения это у меня вызывает?',
    'Что в жизни заставляет меня испытывать энтузиазм?',
    'Что в этом заставляет меня испытывать энтузиазм?',
    'Какие ощущения это у меня вызывает?',
    'Чем в своей жизни я сейчас горжусь?',
    'Что в этом заставляет меня гордиться?',
    'Какие ощущения это у меня вызывает?',
    'За что в своей жизни я сейчас благодарен?',
    'Что в этом заставляет меня чувствовать благодарность?',
    'Какие ощущения это у меня вызывает?',
    'Что прямо сейчас в моей жизни больше всего доставляет мне удовольствие?',
    'Что в этом доставляет мне удовольствие?'
  ];
  ListDataMorning();
}