// import 'dart:math';

// List bankQuestions = [q200, q201, q202];

var q200 = 'При каких обстоятельствах, в каких условиях вы понимаете, что добились успеха в своем деле?';
var q201 = 'Какие шаги вы можете сделать в течение следующих 3 дней?';
var q202 = 'Что вы сделаете на этой неделе для достижения своей цели?';
var q203 = 'Какие события произошли со времени нашей последней встречи?';
var q204 = 'Что бы вам хотелось обсудить?';
var q205 = 'О чем вам интересно сегодня поговорить?';
var q206 = 'Что нового/что изменилось?';
var q207 = 'Как прошла неделя?';
var q208 = 'Как ваши дела?';
var q209 = 'В чем, на ваш взгляд, заключается проблема/задача?';

var q210 = 'Что вам представляется самым серьезным препятствием?';
var q211 = 'Что вас больше всего беспокоит в этом?';
var q212 = 'Чего вы хотите добиться?';
var q213 = 'Каков ваш вывод?';
var q214 = 'Как все это работает?';
var q215 = 'Как бы вы описали эту ситуацию?';
var q216 = 'Что, на ваш взгляд, это означает?';
var q217 = 'Как на этот вопрос ответил бы ваш самый близкий человек?';
var q218 = 'Кратко охарактеризуйте свои действия?';
var q219 = 'Какие действия вы предпримете?';

var q220 = 'Что люди скажут о вас на ваших похоронах?';
var q221 = 'Когда вы это сделаете?';
var q222 = 'Надо ли что-то делать прямо сейчас?';
var q223 = 'Что вы намерены делать далее?';
var q224 = 'Каковы ваши последующие действия?';
var q225 = 'К какому сроку вы намерены выполнить намеченные действия?';
var q226 = 'Как вы думаете, как все сложится?';
var q227 = 'Что будет, если все сложится так, как вы бы этого хотели?';
var q228 = 'К чему это приведет?';
var q229 = 'Что это вам даст?';

var q230 = 'Что за этим стоит?';
var q231 = 'Что подсказывает вам интуиция?';
var q232 = 'Как вы это оцениваете?';
var q233 = 'Что, на ваш взгляд, лучше сейчас сделать?';
var q234 = 'Как вам понравится такой вариант?';
var q235 = 'Что вы на это скажете?';
var q236 = 'Как это отразится на вас?';
var q237 = 'Что вы имеете в виду?';
var q238 = 'Что еще осталось для вас непонятным?';
var q239 = 'Можете рассказать больше?';

var q240 = 'Чего именно вы хотите?';
var q241 = 'Расскажите, пожалуйста, больше?';
var q242 = 'Что ещё вы об этом думаете?';
var q243 = 'Если бы вы могли вернуться назад, что бы вы сделали иначе?';
var q244 = 'Случись это с вами, что бы вы сделали?';
var q245 = 'Как ещё можно разрешить эту ситуацию? А ещё?';
var q246 = 'Что бы вы сделали, если бы у вас не было никаких ограничений?';
var q247 = 'Что для вас означает веселье/радость/счастье?';
var q248 = 'Что было смешного/грустного во всём этом?';
var q249 = 'Что вы можете предпринять для того, чтобы сделать это еще интереснее/веселее/лучше?';

var q250 = 'Как это должно быть устроено?';
var q251 = 'Если бы вам нужно было научить людей получать удовольствие от этого, что бы вы сказали?';
var q252 = 'Чем это было вызвано?';
var q253 = 'Что привело к этому?';
var q254 = 'Что вы пытались сделать?';
var q255 = 'Как вы можете все это объяснить?';
var q256 = 'Какой у вас план действий?';
var q257 = 'Что нужно сделать для того, чтобы выполнить эту работу?';
var q258 = 'Какая помощь нужна вам для выполнения этой работы?';
var q259 = 'Что может вас поддержать?';

var q260 = 'Когда вы приступите к выполнению работы?';
var q261 = 'Что здесь нужно устранить?';
var q262 = 'Как вы объясняете это самому себе?';
var q263 = 'Как вы можете сохранить для себя то, чему вы научились?';
var q264 = 'Как можно применить эти знания?';
var q265 = 'Каким образом можно свести все это воедино?';
var q266 = 'Что бы вы сделали, если бы от этого решения зависела ваша жизнь?';
var q267 = 'Что бы вы сделали, если бы ничто не влияло на ваше решение?';
var q268 = 'Что бы вы сделали, если бы подобное повторилось?';
var q269 = 'Что бы вы сделали, если бы можно было все начать сначала?';

var q270 = 'Что бы вы сделали, если бы можно было переиграть всю ситуацию заново?';
var q271 = 'Какие существуют варианты возможных действий?';
var q272 = 'Что бы вы выбрали, если бы на ваше решение не влияли внешние факторы?';
var q273 = 'Что будет, если вы примете это решение?';
var q274 = 'Что будет, если вы не примете это решение?';
var q275 = 'Какие другие варианты вы можете предложить?';
var q276 = 'На что вы рассчитываете в итоге?';
var q277 = 'Если вы добьетесь своего, что это вам даст?';
var q278 = 'В чём заключается ваша цель?';
var q279 = 'Представьте, что вам 80 лет. Что вы скажете о прошедшей жизни?';

var q280 = 'Что вы подумаете об этом через пять/десять/двадцать лет?';
var q281 = 'Какое это имеет отношение к цели вашей жизни?';
var q282 = 'Насколько это важно с позиции оценки временем?';
var q283 = 'Что вы планируете сделать в этом отношении?';
var q284 = 'Какова ваша стратегия?';
var q285 = 'Какую программу действий вам необходимо разработать?';
var q286 = 'Как вы можете изменить ситуацию в лучшую сторону?';
var q287 = 'Составьте список, как ваша жизнь будет выглядеть на этой неделе?';
var q288 = 'Что с нашей последней сессии работало для вас?';
var q289 = 'Что не работало?';

var q290 = 'Что вы больше всего хотите от меня сегодня?';
var q291 = 'Какие инсайты/мысли пришли к вам после нашей последней сессии?';
var q292 = 'Чем я могу помочь вам на этой неделе?';
var q293 = 'Закончив какие дела на этой неделе, вы будете очень радоваться?';
var q294 = 'Какое самое большое изменение вы готовы сделать сегодня?';
var q295 = 'Что вы хотите сразу после этой сессии?';
var q296 = 'Что вы больше всего хотите от следующих 30/50/90 минут?';
var q297 = 'Что бы вы хотели убрать из этой сессии?';
var q298 = 'Что больше не приносит результата?';
var q299 = 'Что вызовет вашу улыбку, если мы проработаем это прямо сейчас?';

// ####
var q300 = 'Представьте, что у вас была идеальная неделя. Какие 3 вещи вы сделали?';
var q301 = 'Что мы можем проработать, чтобы это помогало вам в ближайшие несколько недель/дней?';
var q302 = 'О чем вы сейчас подумали, но не сказали этого?';
var q303 = 'Что сейчас происходит?';
var q304 = 'Какие конкретные цели вы хотите достичь, работая с коучем?';
var q305 = 'Чем я могу быть вам полезен?';
var q306 = 'Что вы уже сделали для своих целей?';
var q307 = 'Как вы оцените успех коучинга в конце?';
var q308 = 'Каким коучем вы хотите меня видеть?';
var q309 = 'Чего вы ожидаете от коучинга?';

var q310 = 'Что вам больше всего нужно от меня?';
var q311 = 'Какая самая захватывающая часть работы с коучем по вашему мнению?';
var q312 = 'Что вас больше всего пугает/отталкивает в работе с коучем?';
var q313 = 'Вы сейчас сопротивляетесь?';
var q314 = 'Какое самое большое изменение вы готовы сделать сегодня?';
var q315 = 'Что вы будете делать сразу после сегодняшней сессии?';
var q316 = 'Что вы терпите?';
var q317 = 'Ради чего вы миритесь с этой ситуацией?';
var q318 = 'Что вы любите?';
var q319 = 'Что вы не любите?';

var q320 = 'Каковы ваши текущие задачи?';
var q321 = 'Что вас вдохновляет?';
var q322 = 'Представьте – вы не можете потерпеть неудачу. Что бы вы хотели сделать?';
var q323 = 'Что вас больше всего беспокоит?';
var q324 = 'Вы знаете людей в своем окружении, которые уже сделали/делали это?';
var q325 = 'Можете спросить у них? Что они делали?';
var q326 = 'Какие три вещи вы хотели бы сделать прежде чем умереть?';
var q327 = 'Если бы вы полностью жили своей жизнью, какое первое изменение вы начали бы делать?';
var q328 = 'Чего вы тайно хотите?';
var q329 = 'Какая у вас тайная страсть?';

var q330 = 'Чего не хватает в вашей жизни?';
var q331 = 'Какие области вашей жизни можно было бы обновить?';
var q332 = 'Какие три вещи сделают наибольшие изменения в вашей жизни?';
var q333 = 'Если бы вы посмели сказать это вслух, что бы вы сделали в своей карьере или жизни?';
var q334 = 'Если бы вы выиграли в лотерею, что бы вы сделали?';
var q335 = 'Если бы вы могли сделать что угодно, какова была бы ваша идеальная карьера/жизнь/семья?';
var q336 = 'Если бы был результат, который вы сделали незаметно для окружающих, что бы это было?';
var q337 = 'Если вы найдете решение этого вопроса, что в наибольшей степени повлияет на вашу жизнь?';
var q338 = 'Какие три вещи вы делаете регулярно, но они не служат вам и не поддерживают вас?';
var q339 = 'Какие полезные привычки помогают вам в достижении цели?';

var q340 = 'Что должно измениться, чтобы ваша жизнь стала идеальной?';
var q341 = 'Какое одно изменение вы могли бы сделать, чтобы получить больше радости/спокойствия/любви?';
var q342 = 'Представьте, что вам 80 лет, вы оглянулись на свою жизнь. Что вы сделали, чтобы гордиться собой?';
var q343 = 'О чём вы мечтаете всю жизнь?';
var q344 = 'Что для вас сейчас является преградой?';
var q345 = 'Как вы относитесь к удвоению/увеличению этой цели?';
var q346 = 'Какова ваша тема развития на предстоящий год – одним словом?';
var q347 = 'Где вы хотите быть через 3/5/10/20 лет?';
var q348 = 'Что вам нужно успешно завершить в следующем году, чтобы это произошло?';
var q349 = 'Что вы хотите увеличить в своей жизни?';

var q350 = 'Что вы хотите сократить в своей жизни?';
var q351 = 'Чего вы хотите, но не имеете?';
var q352 = 'Что есть в вашей жизни, но вы этого не хотите/хотите от этого избавиться?';
var q353 = 'Что вас больше всего волнует в следующем году?';
var q354 = 'Чего вы хотите достичь в следующем году/полугодии/месяце?';
var q355 = 'Какова ваша самая крупная задача в предстоящем году?';
var q356 = 'Каковы ваши 3 главных приоритета на следующий год?';
var q357 = 'Представьте: вы не делаете ничего кроме трех вещей, но они делают ваш год успешным. Что это?';
var q358 = 'Как вы пойдете навстречу вашей цели?';
var q359 = 'Как вы можете сделать свою цель позитивной декларацией?';

var q360 = 'Насколько серьёзно вы относитесь к цели?';
var q361 = 'Опишите свой желаемый результат?';
var q362 = 'Представьте, что вы достигли цели. Какую пользу она вам принесла?';
var q363 = 'Что для вас самое главное в цели?';
var q364 = 'Что должно произойти, чтобы вы изменили своё мнение?';
var q365 = 'Что должно произойти, чтобы вы почувствовали себя лучше/уверенней?';
var q366 = 'Кто поставил эту цель?';
var q367 = 'Придумайте метафору этому?';
var q368 = 'Вы можете это сделать?';
var q369 = 'Какие ресурсы у вас есть для этого?';

var q370 = 'Насколько эта цель важна для вас по шкале от 1 до 10?';
var q371 = 'Как достижение цели повлияет на другие сферы вашей жизни?';
var q372 = 'Эта цель только для вас?';
var q373 = 'Насколько эта цель важна для вас лично по шкале от 1 до 10?';
var q374 = 'Как эта цель согласуется с вашими ценностями?';
var q375 = 'Какие убеждения вам мешают?';
var q376 = 'Какие убеждения/установки у вас есть по этому поводу?';
var q377 = 'Согласуется ли данная цель с общим видением вашей будущей жизни?';
var q378 = 'Куда вас ведет эта цель?';
var q379 = 'Эта цель – ваше истинное желание, или вы думаете, что это почему-то нужно иметь/сделать/получить?';

var q380 = 'Когда вы думаете о своей цели, что вы чувствуете?';
var q381 = 'Предположим на мгновение, что вы достигли цели, опишите это. Что вы чувствуете, видите, слышите и говорите себе?';
var q382 = 'Как изменится ваша жизнь после достижения цели?';
var q383 = 'На что больше всего повлияет достижение цели?';
var q384 = 'На кого (еще) повлияет достижение цели?';
var q385 = 'Как отнесутся ваши родные, друзья, партнер, когда вы достигните эту цель?';
var q386 = 'Представьте, как будет проходить ваш обычный день после достижения этой цели?';
var q387 = 'Что вы скажете себе, когда достигните результата?';
var q388 = 'Как вы отпразднуете достижение цели?';
var q389 = 'Какие сферы жизни затронет достижение этой цели?';

var q390 = 'В каких точках эта цель согласуется с вашими приоритетами и текущим образом жизни?';
var q391 = 'Какова цена достижения этой цели?';
var q392 = 'Какова цена недостижения этой цели?';
var q393 = 'Вы готовы заплатить эту цену?';
var q394 = 'Как ваша жизнь может стать лучше с этой новой целью?';
var q395 = 'Как ваша жизнь может стать хуже с этой новой целью?';
var q396 = 'Вы можете решить эту задачу самостоятельно, или вам нужна помощь?';
var q397 = 'Чья помощь вам нужна для достижения цели?';
var q398 = 'Какая помощь вам нужна от этого человека?';
var q399 = 'Как и где вы можете попросить помощи?';


// https://stackoverflow.com/questions/61435446/how-to-select-random-element-from-a-list-in-flutter
// int randomIndex = Random().nextInt(bankQuestions.length);

// 200+
class AllQuestions {
}

