// import 'dart:math';

// List bankQuestions = [q200, q201, q202];

var q200 = 'При каких обстоятельствах, в каких условиях вы понимаете, что добились успеха в своем деле?';
var q201 = 'Какие шаги вы можете сделать в течение следующих 3 дней?';
var q202 = 'Что вы сделаете на этой неделе для достижения своей цели?';
var q203 = 'Какие события произошли со времени нашей последней встречи?';
var q204 = 'Что бы вам хотелось обсудить?';
var q205 = 'О чем вам интересно сегодня поговорить?';
var q206 = 'Что нового/что изменилось?';
var q207 = 'Как прошла неделя?';
var q208 = 'Как ваши дела?';
var q209 = 'В чем, на ваш взгляд, заключается проблема/задача?';

var q210 = 'Что вам представляется самым серьезным препятствием?';
var q211 = 'Что вас больше всего беспокоит в этом?';
var q212 = 'Чего вы хотите добиться?';
var q213 = 'Каков ваш вывод?';
var q214 = 'Как все это работает?';
var q215 = 'Как бы вы описали эту ситуацию?';
var q216 = 'Что, на ваш взгляд, это означает?';
var q217 = 'Как на этот вопрос ответил бы ваш самый близкий человек?';
var q218 = 'Кратко охарактеризуйте свои действия?';
var q219 = 'Какие действия вы предпримете?';

var q220 = 'Что люди скажут о вас на ваших похоронах?';
var q221 = 'Когда вы это сделаете?';
var q222 = 'Надо ли что-то делать прямо сейчас?';
var q223 = 'Что вы намерены делать далее?';
var q224 = 'Каковы ваши последующие действия?';
var q225 = 'К какому сроку вы намерены выполнить намеченные действия?';
var q226 = 'Как вы думаете, как все сложится?';
var q227 = 'Что будет, если все сложится так, как вы бы этого хотели?';
var q228 = 'К чему это приведет?';
var q229 = 'Что это вам даст?';

var q230 = 'Что за этим стоит?';
var q231 = 'Что подсказывает вам интуиция?';
var q232 = 'Как вы это оцениваете?';
var q233 = 'Что, на ваш взгляд, лучше сейчас сделать?';
var q234 = 'Как вам понравится такой вариант?';
var q235 = 'Что вы на это скажете?';
var q236 = 'Как это отразится на вас?';
var q237 = 'Что вы имеете в виду?';
var q238 = 'Что еще осталось для вас непонятным?';
var q239 = 'Можете рассказать больше?';

var q240 = 'Чего именно вы хотите?';
var q241 = 'Расскажите, пожалуйста, больше?';
var q242 = 'Что ещё вы об этом думаете?';
var q243 = 'Если бы вы могли вернуться назад, что бы вы сделали иначе?';
var q244 = 'Случись это с вами, что бы вы сделали?';
var q245 = 'Как ещё можно разрешить эту ситуацию? А ещё?';
var q246 = 'Что бы вы сделали, если бы у вас не было никаких ограничений?';
var q247 = 'Что для вас означает веселье/радость/счастье?';
var q248 = 'Что было смешного/грустного во всём этом?';
var q249 = 'Что вы можете предпринять для того, чтобы сделать это еще интереснее/веселее/лучше?';

var q250 = 'Как это должно быть устроено?';
var q251 = 'Если бы вам нужно было научить людей получать удовольствие от этого, что бы вы сказали?';
var q252 = 'Чем это было вызвано?';
var q253 = 'Что привело к этому?';
var q254 = 'Что вы пытались сделать?';
var q255 = 'Как вы можете все это объяснить?';
var q256 = 'Какой у вас план действий?';
var q257 = 'Что нужно сделать для того, чтобы выполнить эту работу?';
var q258 = 'Какая помощь нужна вам для выполнения этой работы?';
var q259 = 'Что может вас поддержать?';

var q260 = 'Когда вы приступите к выполнению работы?';
var q261 = 'Что здесь нужно устранить?';
var q262 = 'Как вы объясняете это самому себе?';
var q263 = 'Как вы можете сохранить для себя то, чему вы научились?';
var q264 = 'Как можно применить эти знания?';
var q265 = 'Каким образом можно свести все это воедино?';
var q266 = 'Что бы вы сделали, если бы от этого решения зависела ваша жизнь?';
var q267 = 'Что бы вы сделали, если бы ничто не влияло на ваше решение?';
var q268 = 'Что бы вы сделали, если бы подобное повторилось?';
var q269 = 'Что бы вы сделали, если бы можно было все начать сначала?';

var q270 = 'Что бы вы сделали, если бы можно было переиграть всю ситуацию заново?';
var q271 = 'Какие существуют варианты возможных действий?';
var q272 = 'Что бы вы выбрали, если бы на ваше решение не влияли внешние факторы?';
var q273 = 'Что будет, если вы примете это решение?';
var q274 = 'Что будет, если вы не примете это решение?';
var q275 = 'Какие другие варианты вы можете предложить?';
var q276 = 'На что вы рассчитываете в итоге?';
var q277 = 'Если вы добьетесь своего, что это вам даст?';
var q278 = 'В чём заключается ваша цель?';
var q279 = 'Представьте, что вам 80 лет. Что вы скажете о прошедшей жизни?';

var q280 = 'Что вы подумаете об этом через пять/десять/двадцать лет?';
var q281 = 'Какое это имеет отношение к цели вашей жизни?';
var q282 = 'Насколько это важно с позиции оценки временем?';
var q283 = 'Что вы планируете сделать в этом отношении?';
var q284 = 'Какова ваша стратегия?';
var q285 = 'Какую программу действий вам необходимо разработать?';
var q286 = 'Как вы можете изменить ситуацию в лучшую сторону?';
var q287 = 'Составьте список, как ваша жизнь будет выглядеть на этой неделе?';
var q288 = 'Что с нашей последней сессии работало для вас?';
var q289 = 'Что не работало?';

var q290 = 'Что вы больше всего хотите от меня сегодня?';
var q291 = 'Какие инсайты/мысли пришли к вам после нашей последней сессии?';
var q292 = 'Чем я могу помочь вам на этой неделе?';
var q293 = 'Закончив какие дела на этой неделе, вы будете очень радоваться?';
var q294 = 'Какое самое большое изменение вы готовы сделать сегодня?';
var q295 = 'Что вы хотите сразу после этой сессии?';
var q296 = 'Что вы больше всего хотите от следующих 30/50/90 минут?';
var q297 = 'Что бы вы хотели убрать из этой сессии?';
var q298 = 'Что больше не приносит результата?';
var q299 = 'Что вызовет вашу улыбку, если мы проработаем это прямо сейчас?';

// https://stackoverflow.com/questions/61435446/how-to-select-random-element-from-a-list-in-flutter
// int randomIndex = Random().nextInt(bankQuestions.length);

// 200+
class AllQuestions {
}

