
// Заголовки экранов

// Intro
const String t0='Введение';
const String t0_1='Коучинг… Волшебное взаимодействие двух людей, в процессе которого клиент при поддержке коуча раскрывает свой потенциал, находит пути решения задачи, заглядывает вглубь себя и достигает желаемых целей наиболее эффективным, экологичным и быстрым способом.';
const String t0_2='Именно коучинг собрал максимум полезного из самых разных направлений психологии и психотерапии, начиная от НЛП и заканчивая транзактным анализом.';
const String t0_3='Первое, что приходит на ум, когда мы говорим о коучинге, – эффективные вопросы. Коучинг – это искусство задавать правильные вопросы, стимулирующие воображение и мышление клиента, дающие возможность для свободного размышления и поиска вариантов.';
const String t0_4='Всё это приложение посвящено трансформационным вопросам. Варианты, которые можно найти, придумать, применить на практике – собраны здесь.';
const String t0_5='Здесь намеренно не разделены вопросы на категории. Это сделано, чтобы не ограничивать вас. Каждый профессиональный или начинающий коуч, который провел хотя бы несколько сессий, знает, что коучинговое взаимодействие имеет структуру, но самое важное – глубокий контакт с клиентом. Все остальное происходит стихийно и часто спонтанно. Все внимание коуча направлено на клиента. За интересом клиента мы и следуем. Искусство поиска подходящего вопроса приходит с опытом.';
const String t0_6='Все вопросы написаны в форме обращения коуча к клиенту, кроме вопросов от Тони Роббинса. Конечно, каждый из вопросов можно и нужно адресовать и себе при самокоучинге.';
const String t0_7='Я надеюсь, это приложение поможет людям, которые пока только начали интересоваться темой саморазвития, найти интересные вопросы для размышления, узнать что-то новое о себе и достичь результата.';

const String t1='Решение любой проблемы';
